# Библиотека Pandas
## Data Frame. Индексация и селекция

In [2]:
import pandas as pd
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

### Работа с полями
#### Узнаем тип полей

In [3]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

#### Изменим тип поля

In [5]:
frame.Birth = frame.Birth.apply(pd.to_datetime)
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [6]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

### Получение информации о Data Frame

In [10]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 240.0+ bytes

### Работа с NA

In [13]:
frame.fillna('разнорабочий', inplace=True)
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

### Вывод столбцов
#### Как Series

In [14]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

#### Как Data Frame

In [16]:
frame[['Position', 'Name']]

       Position             Name
0  разнорабочий      Иванов А.А.
1       инженер     Сорокин И.В.
2      менеджер       Белов М.М.
3  разнорабочий  Мельникова Д.С.
4       инженер      Рыбина Е.П.
5        стажер     Костров С.О.

### Вывод строк

In [20]:
frame.head(2)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер

In [21]:
frame[0:2]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер

In [19]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [22]:
frame.loc[[1,3,5], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [23]:
frame.iloc[[1,3,5], [0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

Но есть frame.ix, который поддерживает и то, и другое:

In [25]:
frame.ix[[1,2,3], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
2       Белов М.М.     Ростов
3  Мельникова Д.С.     Ростов

In [26]:
frame.ix[[1,2,3], [0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
2       Белов М.М.     Ростов
3  Мельникова Д.С.     Ростов

### Фильтрация данных

In [29]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [30]:
frame[(frame.Birth >= pd.datetime(1885,1,1)) & (frame.City != 'Москва')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий

In [31]:
frame[(frame.Birth >= pd.datetime(1885,1,1)) | (frame.City == 'Волгоград')]

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер